xpress-embedo/ESP32P4/weather_mon_cfg_wifi/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_INIT_VERSION="6.0.2"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# My Board lets keep it 90MHz, in newer one it is 100MHz
# NOTE: Somehow this doesn't work from .defaults file, so need to update manually
CONFIG_BOOTLOADER_CPU_CLK_FREQ_MHZ=90

# The board I have work with 360MHz and not 400MHz, hence this setting is must
# else clock check will fail and system will not work
# NOTE: Somehow this doesn't work from .defaults file, so need to update manually
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360

# ESP32P4 Function EV Board which I have is not new and that's why this setting
# is needed, and if not used bootloader size will exceed and programming board
# will become difficult, and it may not work also
# NOTE: Somehow this doesn't work from .defaults file, so need to update manually
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_ESP32P4_REV_MIN_FULL=1
CONFIG_ESP_REV_MIN_FULL=1
CONFIG_ESP32P4_REV_MAX_FULL=199
CONFIG_ESP_REV_MAX_FULL=199
CONFIG_ESP_EFUSE_BLOCK_REV_MIN_FULL=0
CONFIG_ESP_EFUSE_BLOCK_REV_MAX_FULL=199

# FreeRTOS Clock
CONFIG_FREERTOS_HZ=1000

# External PSRAM setting
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Watchdog setting
CONFIG_TASK_WDT_TIMEOUT_S=10

# TLS Setting
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
# With newer version of ESP-IDF Framework, need to increase the IN_LEN to 16K
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_DEBUG=y
CONFIG_MBEDTLS_DEBUG_LEVEL_WARN=y

CONFIG_HTTPD_MAX_URI_LEN=1024

# LVGL Setting
# CONFIG_LV_USE_SYSMON=y
# CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_PERF_MONITOR_ALIGN_BOTTOM_RIGHT=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128
# CONFIG_LV_BUILD_EXAMPLES is not set
# CONFIG_LV_BUILD_DEMOS is not set
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Custom Setting
CONFIG_ESP_WIFI_SSID="SECOND"
CONFIG_ESP_WIFI_PASSWORD="Brutal@garry"
CONFIG_INFLUXDB_URL="https://us-east-1-1.aws.cloud2.influxdata.com"
CONFIG_INFLUXDB_ORG="697c4e83a61ce79b"
CONFIG_INFLUXDB_BUCKET="EmLab"
CONFIG_INFLUXDB_TOKEN="ZUhdAhpcI806uM-OG9GrIL1NOBvsfOFzB26f37xVAFH-QNH-JOndHiaQevUxi-vt_RvsODb-gyV5KnPKwlnaKg=="